import asyncio #для ассинхронности
import logging #для вывода информации в консоль
from aiogram import Bot, Dispatcher, Router #основные классы aiogram
from aiogram.filters import Command #для обработки команд
from aiogram.types import Message #для работы с сообщениями
from config import BOT_TOKEN #импортируем токен из config.py
from aiogram.types import ReplyKeyboardMarkup, KeyboardButton, ReplyKeyboardRemove #Для добавления кнопок
from aiogram import F # для фильтров (кнопок)

#настраиваем логирование(что бы видеть что происходит)
logging.basicConfig(level=logging.INFO) # выводим информацию в консоль

#создаём тело бота
bot = Bot(token=BOT_TOKEN)

#Создаём диспетчер - это мозг бота который решает что длеать с сообщениями
dp = Dispatcher()

#Создаём роутер - это маршрутизатор который направляет сообщения к нужным функциям
router = Router()

#Создаём клавиатуру
#ReplyKeyboardMarkup - клавиатура под полем ввода
main_keyboard = ReplyKeyboardMarkup(
    keyboard=[
        #первый ряд кнопок (две кнопки рядом)
        [
            KeyboardButton(text="👋Приветствие!"),
            KeyboardButton(text="❓Помощь")
        ],
        #Второй ряд кнопок\
        [
            KeyboardButton(text="ℹ️О боте"),
            KeyboardButton(text="🎲Случайное число")
        ],
        #Третий ряд (одна большая кнопка)
        [
            KeyboardButton(text="📞Мои контакты")
        ]
    ],
    resize_keyboard = True, #Кнопки подстраиваются под размер экрана
    one_time_keyboard = False, #клавиатура не скрывается после нажатия
    input_field_placeholder = "Выберите действие..." #текст-подсказка в поле ввода
)

#говорим диспетчеру используй этот роутер
dp.include_router(router)

#создаем комманду start
#@router.message - это "ДЕКОРАТОР", он оборачивает функцию
#Command("start") - говорит "эта функция для команды start"

@router.message(Command("start"))
async def cmd_start(message:Message):
    #message.from_user.first_name - имя пользователя из TG
    user_name = message.from_user.first_name

    welcome_text = f"""
Приветствую тебя, {user_name}!
 Я первый тг бот разработчика Ярослав,
 написан на python с использованием  aiogram 3.10.0

 Попробуй команды:
 /start - это сообщение
 /help - помощь
"""
    # отпровляем сообщение пользователю
    # await - подожди пока отправиться
    # message.answer - метод ответить на сообщение
    await message.answer(welcome_text, reply_markup=main_keyboard)

@router.message(Command("help"))
async def cmd_help(message:Message):
    help_text = """
📚 Список доступных команд:

/start - Начать работу с ботом
/help - Получить справку

🎮 Что я умею:
• Отвечать на команды
• Отвечать на кнопки
• Генерировать случайные числа
• Повторять твои сообщения

Просто нажимай кнопки и эксперементируй ✨
"""
    await message.answer(help_text)

#Обработчик кнопки "Приветствие"
#F.text == "Приветствие" - фильтр: "Если текст сообщения равен 'Приветствие'"
@router.message(F.text=="👋Приветствие!")
async def hello_btn(message:Message):
    response = F"Привет, {message.from_user.first_name}, рад тебя видеть!"
    await message.answer(response)

@router.message(F.text=="❓Помощь")
async def help_btn(message:Message):
    response = """
📚 Список доступных команд:

/start - Начать работу с ботом
/help - Получить справку

🎮 Что я умею:
• Отвечать на команды
• Отвечать на кнопки
• Генерировать случайные числа
• Повторять твои сообщения

Просто нажимай кнопки и эксперементируй ✨
"""
    await message.answer(response)

@router.message(F.text=="ℹ️О боте")
async def about_btn(message:Message):
    response = """
📊 Информация о боте:

Версия: 2.0 (с кнопками!)
Библиотека: aiogram 3.10.0
Язык: Python 3.11
Автор: Ярослав! 🎉

📍 Бот создан в редакторе VS Code
📍 Использует виртуальное окружение
📍 Имеет модульную структуру
"""
    await message.answer(response)

@router.message(F.text=="📞Мои контакты")
async def contact_btn(message:Message):
    response = """
📞 Контакты:

Telegram: @YarikRaak
Email: yaroslav.lagoshin2005@gmail.com
GitHub: github.com/RakKovskY

🔧 Этот бот - учебный проект.
"""
    await message.answer(response)

@router.message(F.text=="🎲Случайное число")
async def rand_int(message:Message):
    import random
    random_number = random.randint(1,100)
    response = f"Тебе выпало: {random_number}"
    await message.answer(response)

#создаём эхо бот
#@router.message() - ловит ВСЕ сообщения
@router.message()
async def echo_msg(message:Message):
    #список текстов кнопок
    keyboard_text = ["👋Приветствие!", "❓Помощь",
                     "ℹ️О боте", "🎲Случайное число",
                     "📞Мои контакты"
                     ]
    
    #проверяем не является ли сообщение командой
    if message.text.startswith('/'):
        return
    
    # если это текст кнопки выходим
    if message.text in keyboard_text:
        return
    
    #получаем сообщение пользователя
    user_text = message.text

    #формируем ответ
    response = f"Вы написали: {user_text}!"

    #отправляем ответ
    await message.answer(response)

#главная функция запуска
async def main():
    print("=" * 50)  # рисуем линию из 50 знаков =
    print("🤖 ЗАПУСКАЕМ ТЕЛЕГРАМ-БОТА...")
    print("=" * 50)
    print("✅ Бот запущен и готов к работе!")
    print("🔍 Ищите бота в Telegram по username")
    print("💬 Напишите ему /start")
    print("🛑 Нажмите Ctrl+C для остановки")
    print("=" * 50)

    # запускаем опрос серверов TG
    #start_polling - постоянно проверяет: "Есть ли новые сообщения"!
    await dp.start_polling(bot)

#Создаём точку входа в программу
if __name__ == "__main__":
    try:
        #запускаем ассинхронную функцию main()
        asyncio.run(main())
    except KeyboardInterrupt:
        # Если нажали Ctrl+C - останавливаем бота
        print("\n" + "=" * 50)
        print("🛑 БОТ ОСТАНОВЛЕН")
        print("=" * 50)